Repository: gunthercox/Salvius
Catalog: cli/GateOne/gateone/i18n/*/LC_MESSAGES/gateone.po
Languages: pt_pt

source: %s -> %s failed requirement: %s
pt_pt: S% - exigência falhou>% s:% s en

source: unknown user -> %s failed requirement: %s
pt_pt: usuário desconhecido - exigência falhou>% s:% s en

source: ERROR: %s
pt_pt: ERRO:% s en

source: Only valid users may access this function
pt_pt: Apenas os usuários podem acessar esta função en

source: You are not authorized to perform this action
pt_pt: Você não está autorizado a realizar esta ação en

source: Your ability to perform this action has been restricted
pt_pt: A sua capacidade de executar esta ação foi restringida en

source: Creating user directory: %s
pt_pt: Criando diretório de usuário:% s en

source: Google auth failed
pt_pt: Google auth falhou en

source: Kerberos auth failed
pt_pt: Kerberos autenticação falhou en

source: KerberosAuthHandler user: %s
pt_pt: KerberosAuthHandler utilizador:% s de

source: PAM auth failed
pt_pt: PAM auth falhou en

source: PAMAuthHandler user: %s
pt_pt: PAMAuthHandler utilizador:% s en

source: Only valid users please. Thanks!
pt_pt: Somente usuários válidos por favor. Obrigado! en

source: Removing log due to age (>%s old): %s
pt_pt: Remoção de log devido à idade (>% s de idade):% s en

source: You do not have permission to send messages to %s.
pt_pt: Você não tem permissão para enviar mensagens para% s. en

source: You do not have permission to broadcast messages.
pt_pt: Você não tem permissão para transmitir mensagens. en

source: You do not have permission to list connected users.
pt_pt: Você não tem permissão para listar os usuários conectados. en

source: Killing all sessions...
pt_pt: Matando todas as sessões ... en

source: All user sessions have terminated.
pt_pt: Todas as sessões do usuário ter terminado. en

source: The last idle session has timed out. Reloading...
pt_pt: A última sessão ociosa expirou. Recarregar ... en

source: {session} timeout.
pt_pt: {} Sessão timeout. en

source: Exception encountered in timeout_sessions(): {exception}
pt_pt: Excepção encontrada em timeout_sessions (): {} excepção en

source: DownloadHandler: Could not determine use session
pt_pt: DownloadHandler: não foi possível determinar o uso da sessão en

source: {path} has been removed. Removing from file checker.
pt_pt: {Path} foi removido. Remoção de verificador de arquivo. en

source: Exception encountered trying to execute the file update function for {path}...
pt_pt: Exceção encontrou tentando executar a função de atualização de arquivo para {caminho} ... en

source: Access denied for origin: %s
pt_pt: Acesso negado para origem:% s en

source: If you feel this is incorrect you just have to add '%s' to the 'origin' option in your settings. See the docs for details.
pt_pt: Se você sentir isso é incorreto você só tem que adicionar '% s' para o 'origem' opção em suas configurações. Consulte a documentação para obter mais detalhes. en

source: WebSocket opened (%s %s) via origin %s.
pt_pt: WebSocket aberta (% s% s) via% s de origem. en

source: WebSocket opened (unknown user).
pt_pt: WebSocket aberto (usuário desconhecido). en

source: Unauthenticated WebSocket attempt.
pt_pt: Tentativa WebSocket não autenticado. en

source: Message rejected due to invalid origin.
pt_pt: Mensagem rejeitada devido à origem inválido. en

source: 'Error: Message bust be a JSON dict.'
pt_pt: 'Erro: Mensagem busto ser um dicionário JSON. en

source: 'Error: We only accept JSON here.'
pt_pt: 'Erro: Nós só aceitamos JSON aqui. en

source: Error running plugin WebSocket action: %s
pt_pt: Erro ação WebSocket execução plugin:% s en

source: Error/Unknown WebSocket action, %s: %s (%s line %s)
pt_pt: Erro / ação WebSocket Desconhecido,% s:% s (% s linha% s) en

source: WebSocket closed (%s %s).
pt_pt: WebSocket fechado (% s% s). en

source: WebSocket closed (unknown user).
pt_pt: WebSocket fechado (usuário desconhecido). en

source: AUTHENTICATION ERROR: Unsupported API auth signature method: %s
pt_pt: Erro de autenticação: Unsupported API método de assinatura de autenticação:% s en

source: AUTHENTICATION ERROR: Unsupported API version:%s
pt_pt: Erro de autenticação: versão da API não suportado:% s en

source: AUTHENTICATION ERROR: API Key not found.
pt_pt: Erro de autenticação: Chave API não encontrado. en

source: API authentication replay attack detected! User: %s, Remote IP: %s, Origin: %s
pt_pt: API ataque de repetição de autenticação detectado! Usuário:% s, IP remoto:% s, origem:% s en

source: AUTH FAILED: Replay attack detected! This event has been logged.
pt_pt: AUTH FAILED: ataque de repetição detectado! Este evento foi registrado. en

source: API authentication failed due to an expired auth object. If you just restarted the server this is normal (users just need to reload the page). If this problem persists it could be a problem with the server's clock (either this server or the server(s) embedding Gate One).
pt_pt: API de autenticação falhou devido a um objeto de autenticação expirou. Se você só reiniciou o servidor é normal (usuários só precisa recarregar a página). Se o problema persistir, pode ser um problema com o relógio do servidor (ou servidor neste ou no servidor (es) incorporação Gate One). en

source: AUTH FAILED: Authentication object timed out. Try reloading this page (F5).
pt_pt: AUTH FAILED: objeto de autenticação expirou. Tente recarregar esta página (F5). en

source: AUTH FAILED: If the problem persists after reloading this page please contact your server administrator to notify them of the issue.
pt_pt: AUTH FALHA: Se o problema persistir depois de recarregar esta página, por favor contate o administrador do servidor para notificá-los do problema. en

source: API Authentication Successful
pt_pt: API autenticação bem-sucedida en

source: WebSocket auth failed signature check.
pt_pt: WebSocket auth não verificação de assinatura. en

source: Missing API Key in authentication object
pt_pt: Falta a chave de API em objeto de autenticação en

source: Client tried to use API-based authentication but this server is configured with 'auth = "{0}". Did you forget to set 'auth = "api" in your settings?
pt_pt: Cliente tentou usar a API baseada em autenticação, mas este servidor está configurado com 'auth = "{0}". Você se esqueceu de definir 'auth = "api", em suas configurações?

source: AUTHENTICATION ERROR: Server is not configured to perform API-based authentication. Did someone forget to set 'auth = "api" in the settings?
pt_pt: Erro de autenticação: Servidor não está configurado para executar API baseada em autenticação. Será que alguém se esqueça de definir "auth =" api "nas configurações?

source: Authentication failed for unknown user
pt_pt: Falha na autenticação de usuário desconhecido en

source: AUTHENTICATION ERROR: User unknown
pt_pt: Erro de autenticação: Usuário desconhecido en

source: Exception encountered trying to authenticate: %s
pt_pt: Exceção encontrou tentando autenticar:% s en

source: Exception in registered Auth hook: %s
pt_pt: Exceção no gancho Auth registado:% s en

source: send_css is false; will not send JavaScript.
pt_pt: send_css é falso, não enviará JavaScript. en

source: No expired %s files at client %s
pt_pt: Não arquivos% s expirou no cliente% s en

source: Requesting deletion of expired files at client %s: %s
pt_pt: Solicitar exclusão de arquivos expirados em% s do cliente:% s en

source: send_js is false; will not send JavaScript.
pt_pt: send_js é falso, não enviará JavaScript. en

source: send_css is false; will not send CSS.
pt_pt: send_css é falso, não enviará CSS. en

source: send_js_or_css(): File not found: %s
pt_pt: send_js_or_css (): File not found:% s en

source: Translation file, %s could not be found
pt_pt: Arquivo de tradução, s% não pôde ser encontrado en

source: Error: No message to send.
pt_pt: Error: No message to send. pt

source: Error: Missing UPN.
pt_pt: Erro: UPN ausente. is

source: Using %s authentication
pt_pt: Usando a autenticação% s en

source: No authentication method configured. All users will be ANONYMOUS
pt_pt: Nenhum método de autenticação configurado. Todos os usuários serão ANONYMOUS en

source: Loaded plugins: %s
pt_pt: Plugins carregados:% s en

source: DEPRECATED. Use --settings_dir.
pt_pt: OBSOLETO. Uso - settings_dir. en

source: Path to the settings directory. Default: %s
pt_pt: Caminho para o diretório de configurações. Default:% s en

source: Path where Gate One should store temporary global files (e.g. rendered templates, CSS, JS, etc).
pt_pt: Caminho onde Gate One deve armazenar os arquivos temporários globais (por exemplo, modelos prestados, CSS, JS, etc.) en

source: Enable debugging features such as auto-restarting when files are modified.
pt_pt: Ativar recursos de depuração, tais como auto-reiniciar quando os arquivos são modificados. en

source: Use the given 45-character string for cookie encryption.
pt_pt: Use o dado corda 45 caracteres para criptografia de cookie. en

source: DEPRECATED: Use the 'commands' option in the terminal settings.
pt_pt: OBSOLETO: Use a opção 'comandos' nas configurações do terminal. en

source: Run on the given address. Default is all addresses (IPv6 included). Multiple address can be specified using a semicolon as a separator (e.g. '127.0.0.1;::1;10.1.1.100').
pt_pt: Executar no endereço indicado. O padrão é todos os endereços IPv6 (incluído). Vários endereços podem ser especificados usando uma vírgula como separador (por exemplo, '127 .0.0.1; :: 1; 10.1.1.100 ").

source: Run on the given port.
pt_pt: Executar no porto. en

source: Enable Unix socket support.
pt_pt: Ativar Unix apoio soquete. en

source: Path to the Unix socket (if --enable_unix_socket=True).
pt_pt: Caminho para o socket Unix (se - enable_unix_socket = True). en

source: If enabled, Gate One will run without SSL (generally not a good idea).
pt_pt: Se ativado, Gate One será executado sem SSL (geralmente não é uma boa idéia). en

source: Path to the SSL certificate. Will be auto-generated if none is provided.
pt_pt: Caminho para o certificado SSL. Será gerado automaticamente se nenhuma for fornecida. en

source: Path to the SSL keyfile. Will be auto-generated if none is provided.
pt_pt: Caminho para o keyfile SSL. Será gerado automaticamente se nenhuma for fornecida. en

source: Path to a file containing any number of concatenated CA certificates in PEM format. They will be used to authenticate clients if the 'ssl_auth' option is set to 'optional' or 'required'.
pt_pt: Caminho para um arquivo contendo qualquer número de certificados CA concatenados em formato PEM. Eles serão usados ​​para autenticar os clientes se o 'ssl_auth' opção é definida como 'opcional' ou 'obrigatório'. en

source: Enable the use of client SSL (X.509) certificates as a secondary authentication factor (the configured 'auth' type will come after SSL auth). May be one of 'none', 'optional', or 'required'. NOTE: Only works if the 'ca_certs' option is configured.
pt_pt: Permitir o uso de cliente SSL (X.509) certificados como um fator de autenticação secundária (do tipo configurado 'auth' virá após autenticação SSL). Pode ser um dos 'none', 'opcional', ou 'necessária'. NOTA: Só funciona se a opção 'ca_certs "está configurado.

source: Path to the location where user files will be stored.
pt_pt: Caminho para o local onde os arquivos do usuário será armazenado. en

source: Maximum amount of length of time to keep any given user log before it is removed.
pt_pt: Quantidade máxima de tempo para manter qualquer log determinado usuário antes de ser removido. en

source: Path to the location where session information will be stored.
pt_pt: Caminho para o local onde as informações da sessão será armazenado. en

source: Syslog facility to use when logging to syslog (if syslog_session_logging is enabled). Must be one of: %s. Default: daemon,
pt_pt: Syslog para usar quando o registro via syslog (se syslog_session_logging está habilitado). Deve ser um dos seguintes:% s. Default: daemon, en

source: Remote host to send syslog messages to if syslog_logging is enabled. Default: None (log to the local syslog daemon directly). NOTE: This setting is required on platforms that don't include Python's syslog module.
pt_pt: Host remoto para enviar mensagens syslog se syslog_logging está ativado. Padrão: Nenhum (log para o daemon syslog local diretamente). NOTA: Esta definição é necessária em plataformas que não incluem módulo Python syslog. en

source: Amount of time that a session is allowed to idle before it is killed. Accepts <num>X where X could be one of s, m, h, or d for seconds, minutes, hours, and days. Default is '5d' (5 days).
pt_pt: Quantidade de tempo que uma sessão é permitida a ficar ociosa antes de ser morto. Aceita <num> X, onde X pode ser um dos s, m, h, ou d por segundos, minutos, horas e dias. O padrão é '5 d '(5 dias). en

source: Generate a new API key that an external application can use to embed Gate One.
pt_pt: Gerar uma chave nova API que uma aplicação externa pode usar para incorporar Gate One. en

source: Authentication method to use. Valid options are: %s
pt_pt: Método de autenticação para usar. As opções válidas são:% s en

source: How long before an API authentication object becomes invalid. Default is '30s' (30 seconds).
pt_pt: Quanto tempo antes de um objeto de autenticação API torna-se inválido. O padrão é dos anos 30 "(30 segundos).

source: Kerberos REALM (aka DOMAIN) to use when authenticating clients. Only relevant if Kerberos authentication is enabled.
pt_pt: REALM Kerberos (DOMÍNIO aka) para usar ao autenticar clientes. Só é relevante se a autenticação Kerberos está ativado. en

source: Kerberos service (aka application) to use. Defaults to HTTP. Only relevant if Kerberos authentication is enabled.
pt_pt: Kerberos serviço (aplicação aka) para usar. O padrão é HTTP. Só é relevante se a autenticação Kerberos está ativado. en

source: Basic auth REALM to display when authenticating clients. Default: hostname. Only relevant if PAM authentication is enabled.
pt_pt: REALM autenticação básica para exibir ao autenticar clientes. Default: hostname. Só é relevante se a autenticação PAM está ativado. en

source: PAM service to use. Defaults to 'login'. Only relevant if PAM authentication is enabled.
pt_pt: PAM serviço a ser utilizado. Padrões para 'login'. Só é relevante se a autenticação PAM está ativado. en

source: When embedding Gate One, this option is available to templates.
pt_pt: Ao incorporar Gate One, esta opção está disponível para modelos. en

source: The locale (e.g. pt_PT) Gate One should use for translations. If not provided, will default to $LANG (which is '%s' in your current shell), or en_US if not set.
pt_pt: A localidade (por exemplo pt_PT) Gate One deve usar para traduções. Se não for fornecido, será o padrão para $ LANG (que é '% s' em seu escudo atual) ou en_US se não for definido. en

source: A JavaScript object (string) that will be used when running GateOne.init() inside index.html. Example: --js_init="{scheme: 'white'}" would result in GateOne.init({scheme: 'white'})
pt_pt: Um objeto JavaScript (string) que será usado durante a execução GateOne.init () dentro index.html. Exemplo: - js_init = "{esquema: 'branco'}" resultaria em GateOne.init ({esquema: "branco"})

source: If enabled, a separate listener will be started on port 80 that redirects users to the configured port using HTTPS.
pt_pt: Se ativado, um ouvinte separado será iniciado na porta 80 que redireciona usuários para a porta configurada usando HTTPS. en

source: An optional prefix to place before all Gate One URLs. e.g. '/gateone/'. Use this if Gate One will be running behind a reverse proxy where you want it to be located at some sub-URL path.
pt_pt: Um prefixo opcional para colocar antes de todas as URLs Gate One. por exemplo '/ Gateone /'. Use isso se Gate One será correr atrás de um proxy reverso onde você quer que ele seja localizado em algum caminho de URL-sub. en

source: A semicolon-separated list of origins you wish to allow access to your Gate One server over the WebSocket. This value must contain the hostnames and FQDNs (e.g. foo;foo.bar;) users will use to connect to your Gate One server as well as the hostnames/FQDNs of any sites that will be embedding Gate One. Here's the default on your system: '%s'. Alternatively, '*' may be specified to allow access from anywhere.
pt_pt: Uma lista separada por vírgula de origem que você deseja permitir o acesso ao seu servidor Gate One sobre o WebSocket. Este valor deve conter os nomes de máquinas e FQDNs (por exemplo foo; usuários foo.bar ;) vai usar para se conectar ao servidor Gate One, bem como os nomes de host / FQDNs de quaisquer sites que serão incorporação Gate One. Aqui está o padrão do seu sistema: '% s'. Alternativamente, '*' pode ser especificado para permitir o acesso de qualquer lugar. en

source: Define the path to the pid file. Default: /tmp/gateone.pid
pt_pt: Defina o caminho para o arquivo pid. Default: tmp / gateone.pid / en

source: Drop privileges and run Gate One as this user/uid.
pt_pt: Privilégios de queda e Portão corrida de uma com este usuário / UID. en

source: Drop privileges and run Gate One as this group/gid.
pt_pt: Privilégios de queda e executados Gate One como este grupo / gid. en

source: The 'key:secret,...' API key pairs you wish to use (only applies if using API authentication)
pt_pt: A "chave: segredo, ... ' Pares de chaves de API que você deseja usar (só se aplica se estiver usando a autenticação API

source: Combines all of Gate One's JavaScript files into one big file and saves it at the given path (e.g. ./gateone.py --combine_js=/tmp/gateone.js)
pt_pt: Combina todos os arquivos Gate One do JavaScript em um grande arquivo e salvá-lo no caminho dado (eg / gateone.py -. Combine_js = / tmp / gateone.js) en

source: Combines all of Gate One's CSS Template files into one big file and saves it at the given path (e.g. ./gateone.py --combine_css=/tmp/gateone.css).
pt_pt: Combina todas Gate One de arquivos de modelo CSS em um grande arquivo e salvá-lo no caminho dado (eg / gateone.py -. Combine_css = / tmp / gateone.css). en

source: Use this setting in conjunction with --combine_css if the <div> where Gate One lives is named something other than #gateone
pt_pt: Utilize esta definição em conjunto com - combine_css se o <div> onde Gate One vidas é um nome diferente de # gateone en

source: Gate One settings are incomplete. A new settings/10server.conf will be generated.
pt_pt: Gate One definições são incompletas. A settings/10server.conf novo será gerado. en

source: You have a 10server.conf but it is either invalid (syntax error) or missing essential settings.
pt_pt: Você tem uma 10server.conf mas é inválido (erro de sintaxe) ou faltando configurações essenciais. en

source: Old server.conf file found. Converting to the new format as %s, %s, and %s
pt_pt: Arquivo server.conf velho encontrado. Convertendo para o novo formato como s% s%, e% s en

source: // This file contains the key and secret pairs used by Gate One's API authentication method.
pt_pt: "// Este arquivo contém os pares de chaves e secreto usados pela Gate One método de autenticação do API.

source: // This is Gate One's main settings file.
pt_pt: // Este é o arquivo de configurações do Gate One principal.

source: // This is Gate One's authentication settings file.
pt_pt: // Este é Gate One de autenticação do arquivo de configurações.

source: // This is Gate One's Terminal application settings file.
pt_pt: // Este é Gate One do aplicativo Terminal arquivo de configurações.

source: Could not find/create settings directory at %s
pt_pt: Não foi possível encontrar / criar diretório de configurações em% s en

source: Imported applications: {0}
pt_pt: Aplicações importados: {0} en

source: Error: Gate One could not create %s. Please ensure that user, %s has permission to create this directory or create it yourself and make user, %s its owner.
pt_pt: Erro: Uma Gate não poderia criar% s. Certifique-se de que o usuário,% s tem permissão para criar este diretório ou criá-lo e fazer o usuário,% s seu proprietário. en

source: Failed to recursively change permissions of user_dir: %s, uid: %s, gid: %s
pt_pt: Falha ao alterar as permissões recursivamente de user_dir:% s, uid:% s, gid:% s en

source: [1;31mERROR:[0m Could not create %s for log_file_prefix: %s
pt_pt: ? [1; 31mERROR:? [0m Não foi possível criar% s para log_file_prefix:% s en

source: You probably want to change this option, run Gate One as root, or create that directory and give the proper user ownership of it.
pt_pt: Você provavelmente vai querer mudar essa opção, execute Gate One como root, ou criar o diretório e dar a propriedade de usuário adequado do mesmo. en

source: A new API key has been generated: %s
pt_pt: Uma chave nova API foi gerada:% s en

source: This key can now be used to embed Gate One into other applications.
pt_pt: Esta chave pode agora ser usado para incorporar um portão em outras aplicações. en

source: Gate One %s
pt_pt: Gate One% s en

source: Tornado version %s
pt_pt: Tornado versão% s en

source: Connections to this server will be allowed from the following origins: '%s'
pt_pt: Conexões a este servidor será permitido a partir as seguintes origens: '% s' en

source: No SSL private key found. One will be generated.
pt_pt: Nenhuma chave privada SSL encontrado. Um vai ser gerado. en

source: No SSL certificate found. One will be generated.
pt_pt: Nenhum certificado SSL encontrado. Um vai ser gerado. en

source: Logging is set to DEBUG. Be aware that this will record the keystrokes of all users. Don't be evil!
pt_pt: Log está definido para DEBUG. Esteja ciente de que este irá gravar as teclas de todos os usuários. Não seja mau! en

source: PAM authentication is configured but you are not running Gate One as root. If the pam_service you've selected (%s) is configured to use pam_unix.so for 'auth' (i.e. authenticating against /etc/passwd and /etc/shadow) Gate One will not be able to authenticate all users. It will only be able to authenticate the user that owns the gateone.py process.pam_service
pt_pt: Autenticação PAM está configurada, mas você não está executando um portão como root. Se o pam_service que você selecionou (% s) está configurado para usar pam_unix.so para 'auth' (ou seja, autenticar em / etc / passwd e / etc / shadow) Gate One não será capaz de autenticar todos os usuários. Só será capaz de autenticar o usuário que possui o process.pam_service gateone.py en

source: Listening on Unix socket '{socketpath}'
pt_pt: Ouvir em 'tomada {caminho}' socket sv

source: You have https_redirect *and* disable_ssl enabled. Please pick one or the other.
pt_pt: Você https_redirect * e * disable_ssl habilitado. Por favor, escolher um ou outro. en

source: http://{addr}:80/ will be redirected to...
pt_pt: http:// {addr}: 80 / será redirecionado para ... en

source: Listening on {proto}{address}:{port}/
pt_pt: Ouvir em {proto} {endereço}: {porta} / en

source: http://*:80/ will be redirected to...
pt_pt: http:// *: 80 / será redirecionado para ... en

source: Listening on {proto}*:{port}/
pt_pt: Ouvir em {} * proto: {porta} / en

source: Process running with pid
pt_pt: Processo em execução com pid en

source: Caught KeyboardInterrupt. Killing sessions...
pt_pt: Preso KeyboardInterrupt. Matar sessões ... en

source: pid file removed.
pt_pt: pid removido. en

source: Kerberos/GSSAPI Single Sign-On
pt_pt: Kerberos / GSSAPI Single Sign-On en

source: Kerberos Init failed
pt_pt: Kerberos Init falhou ms

source: Kerberos Error: %s
pt_pt: Erro Kerberos:% s en

source: Headers have already been written
pt_pt: Cabeçalhos já foram escritos en

source: %s does not exist
pt_pt: % S não existe en

source: <-- Something went wrong right here (or right above it)
pt_pt: <- Algo deu errado aqui (ou à direita acima) en
