Repository: gunthercox/Salvius
Catalog: cli/GateOne/gateone/i18n/*/LC_MESSAGES/gateone.po
Languages: pt_pt

source: Got an exception trying to display precisely where the problem was. This usually happens when you've used single quotes (') instead of double quotes (").
pt_pt: Tenho uma exceção tentando mostrar exatamente onde era o problema. Isso geralmente acontece quando você usou aspas simples (') em vez de aspas duplas (").

source: ERROR: Timeout running shell command
pt_pt: ERRO: Timeout comando shell em execução en

source: Error generating self-signed SSL key/certificate: %s
pt_pt: Erro ao gerar auto-assinado chave SSL / certificado:% s en

source: Generating private key with command: %s
pt_pt: Geração de chave privada com o comando:% s en

source: An error occurred trying to create private SSL key: %s
pt_pt: Um erro ocorreu ao tentar criar a chave privada SSL: %s

source: Decrypting private key with command: %s
pt_pt: Descriptografar a chave privada com o comando:% s en

source: An error occurred trying to decrypt private SSL key: %s
pt_pt: Um erro ocorreu ao tentar decifrar a chave privada SSL: %s

source: Creating CSR with command: %s
pt_pt: Criação de CSR com o comando:% s en

source: Generating self-signed certificate with command: %s
pt_pt: Gerando certificado auto-assinado com o comando:% s en

source: Error: You do not have pyOpenSSL installed. Please install it (sudo pip install pyopenssl.
pt_pt: Erro: Você não tem pyOpenSSL instalado. Por favor, instale-o (sudo pip install pyOpenSSL. en

source: Could not open pid_file (%s). You may have to kill gateone.py manually.
pt_pt: Não foi possível abrir pid_file (% s). Você pode ter que matar gateone.py manualmente. en

source: %s does not match a known syslog facility
pt_pt: % S não corresponde a um syslog conhecido en

source: Error: Gate One does not have the ability to recursively chown %s to uid %s/gid %s. Please ensure that user, %s has write permission to the directory.
pt_pt: Erro: Gate One não tem a capacidade de recursivamente chown% s para uid% s / s% gid. Certifique-se de que o usuário, s% tem permissão de gravação para o diretório. en

source: slimit module not found. JavaScript will not be minified.
pt_pt: módulo SLIMIT não encontrado. JavaScript não será minified. en

source: To install slimit: sudo pip install slimit
pt_pt: Para instalar SLIMIT: sudo pip instalar SLIMIT en

source: cssmin module not found. CSS will not be minified.
pt_pt: cssmin módulo não encontrado. CSS não será minified. en

source: To install cssmin: sudo pip install cssmin
pt_pt: Para instalar cssmin: sudo pip install cssmin en

source: (saved ~%s bytes minifying %s)
pt_pt: (Salvo bytes ~% s minifying% s) en

source: Could not set supplemental groups: %s
pt_pt: Não foi possível definir grupos suplementares:% s en

source: Could not set effective group id: %s
pt_pt: Não foi possível definir ID de grupo efetivo:% s en

source: Could not set effective user id: %s
pt_pt: Não foi possível definir ID de usuário efetivo:% s en

source: Non-theme CSS has been combined and saved to: %s
pt_pt: Tema não-CSS foi combinado e salvo:% s en

source: The %s theme CSS has been combined and saved to: %s
pt_pt: CSS% s tema foi combinado e salvo:% s en
